openai_key = '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'

role_info_example = {
    "基本信息": {
        "名字": "艾丽莎·斯通",
        "年龄": 28,
        "性别": "女",
        "职业": "科学记者",
    },
    "性格特征": {
        "主要性格": ["好奇心强", "批判性思维", "独立", "固执"],
        "优点": ["智慧", "勇敢", "诚实"],
        "缺点": ["偏执", "冲动", "有时过于直接"],
        "恐惧": ["失去亲人", "被遗忘", "失败"],
        "喜好": ["阅读科学杂志", "户外运动", "钢琴演奏"],
        "价值观": ["坚信事实和科学","反对一切形式的不实报道"],
    },
    "外貌描述": {
        "身高": "5英尺5英寸",
        "体重": "130磅",
        "眼睛颜色": "绿色",
        "头发": "长卷发，栗色"
    },
    "背景故事": {
        "家庭环境": ["出生于科学家家庭，自幼被教育重视科学方法和探索精神"],
        "教育背景": ["生物学学士学位", "科学传播硕士学位"],
        "过往经历": ["在一次科学展览中获得青年科学家奖", "报道过多次重大科学事件，获得了科学界的认可"],
        "成就": ["建立了一个科学博客，拥有大量忠实读者", "成功揭露了一起科学骗局，为公众揭露了真相"],
        "挫折": ["曾被错误的科学理论误导，导致报道失误", "在科学道德问题上与同行发生过严重争论"]
    },
    "当前状态": {
        "动机": ["揭露学术道德问题","普及科学知识"],
        "目标": ["成为一个知名的科学传播者"],
        "内在冲突": ["在追求真相的过程中，常常挑战权威，导致社会关系紧张"]
    }
}

scene_info_example = {
    "地点": "一家古老的图书馆",
    "时间": "一个阴雨天的下午",
    "氛围": "寂静而神秘，充满陈旧的书香味",
    "听觉": [
        "雨滴打在窗户上",
        "远处雷声",
        "楼上隐约的脚步声"
    ],
    "视觉": [
        "高耸的书架上铺满尘封的书籍",
        "地上铺着历史感十足的红色地毯",
        "角落的大火炉旁摇曳着火苗",
        "半开的窗户透进雨声",
        "大木桌旁黄色台灯下的古老地图",
        "墙上挂着似乎各有故事的古旧画作",
        "老式吊灯微晃，散发着微弱的光线",
        "旧木楼梯旁似有秘密通道"
    ],
    "嗅觉": [
        "空气中弥漫着木头和陈旧书页的味道",
        "新鲜泥土的气息从窗户中飘入",
    ]          
}

action_info_example = {
    "BEHAVIOR": ["打开一本陈旧的书籍，仔细翻阅"],
    "SPEECH": ["对着房间里的其他人说：'这里藏着不为人知的秘密。'"],
    "EXPRESSION": ["脸上露出惊讶的表情，随着发现的深入而眼睛逐渐放大"],
    "PSYCHOLOGICAL_ACTIVITY": ["心理活动复杂，对于可能的发现感到既兴奋又紧张"]
}